{
    "@odata.type":  "#microsoft.graph.macOSCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "0d3a53cb-d45e-42c2-adb1-d141db459ce0",
    "createdDateTime":  "2019-05-26T22:06:22.1473944Z",
    "description":  "Require encryption and system integrity",
    "lastModifiedDateTime":  "2019-07-07T21:43:17.2549054Z",
    "displayName":  "macOS Compliance policy",
    "version":  2,
    "passwordRequired":  false,
    "passwordBlockSimple":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinutesOfInactivityBeforeLock":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordMinimumCharacterSetCount":  null,
    "passwordRequiredType":  "deviceDefault",
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "systemIntegrityProtectionEnabled":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "storageRequireEncryption":  true,
    "gatekeeperAllowedAppSource":  "notConfigured",
    "firewallEnabled":  false,
    "firewallBlockAllIncoming":  false,
    "firewallEnableStealthMode":  false
}
