{
    "@odata.type":  "#microsoft.graph.iosCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "bef5af83-0666-4a36-8e16-7eaa4f3a8f54",
    "createdDateTime":  "2019-05-26T22:06:18.8210261Z",
    "description":  "Block jailbroken devices",
    "lastModifiedDateTime":  "2019-07-07T21:44:24.1785448Z",
    "displayName":  "iOS Compliance Policy",
    "version":  3,
    "passcodeBlockSimple":  true,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  4,
    "passcodeMinutesOfInactivityBeforeLock":  0,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  null,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodeRequiredType":  "numeric",
    "passcodeRequired":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "securityBlockJailbrokenDevices":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "managedEmailProfileRequired":  false,
    "restrictedApps":  [

                       ]
}
