{
    "@odata.type":  "#microsoft.graph.androidGeneralDeviceConfiguration",
    "id":  "b2fe9bd2-20b8-42fb-bcff-d7bca753dae0",
    "lastModifiedDateTime":  "2019-05-26T22:06:21.4926148Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2019-05-26T22:06:21.4926148Z",
    "description":  "Enforce 4-digit passcode and device encryption",
    "displayName":  "Android Baseline Config",
    "version":  1,
    "appsBlockClipboardSharing":  false,
    "appsBlockCopyPaste":  false,
    "appsBlockYouTube":  false,
    "bluetoothBlocked":  false,
    "cameraBlocked":  false,
    "cellularBlockDataRoaming":  false,
    "cellularBlockMessaging":  false,
    "cellularBlockVoiceRoaming":  false,
    "cellularBlockWiFiTethering":  false,
    "compliantAppListType":  "none",
    "diagnosticDataBlockSubmission":  false,
    "locationServicesBlocked":  false,
    "googleAccountBlockAutoSync":  false,
    "googlePlayStoreBlocked":  false,
    "kioskModeBlockSleepButton":  false,
    "kioskModeBlockVolumeButtons":  false,
    "dateAndTimeBlockChanges":  false,
    "nfcBlocked":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  4,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  5,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "passwordRequiredType":  "numeric",
    "passwordRequired":  true,
    "powerOffBlocked":  false,
    "factoryResetBlocked":  false,
    "screenCaptureBlocked":  false,
    "deviceSharingAllowed":  false,
    "storageBlockGoogleBackup":  false,
    "storageBlockRemovableStorage":  false,
    "storageRequireDeviceEncryption":  true,
    "storageRequireRemovableStorageEncryption":  false,
    "voiceAssistantBlocked":  false,
    "voiceDialingBlocked":  false,
    "webBrowserBlockPopups":  false,
    "webBrowserBlockAutofill":  false,
    "webBrowserBlockJavaScript":  false,
    "webBrowserBlocked":  false,
    "webBrowserCookieSettings":  "browserDefault",
    "wiFiBlocked":  false,
    "securityRequireVerifyApps":  false,
    "compliantAppsList":  [

                          ],
    "kioskModeApps":  [

                      ],
    "appsInstallAllowList":  [

                             ],
    "appsLaunchBlockList":  [

                            ],
    "appsHideList":  [

                     ]
}
