{
    "@odata.type":  "#microsoft.graph.macOSEndpointProtectionConfiguration",
    "id":  "b071dfba-581a-4a61-b951-4c182c9b37be",
    "lastModifiedDateTime":  "2019-05-26T22:06:23.4490006Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2019-05-26T22:06:23.4490006Z",
    "description":  "Enable Firewall with Stealth mode",
    "displayName":  "macOS Baseline Endpoint Protection",
    "version":  1,
    "gatekeeperAllowedAppSource":  "notConfigured",
    "gatekeeperBlockOverride":  false,
    "firewallEnabled":  true,
    "firewallBlockAllIncoming":  false,
    "firewallEnableStealthMode":  true,
    "fileVaultEnabled":  false,
    "fileVaultSelectedRecoveryKeyTypes":  "notConfigured",
    "fileVaultInstitutionalRecoveryKeyCertificate":  null,
    "fileVaultInstitutionalRecoveryKeyCertificateFileName":  null,
    "fileVaultPersonalRecoveryKeyHelpMessage":  null,
    "fileVaultAllowDeferralUntilSignOut":  false,
    "fileVaultNumberOfTimesUserCanIgnore":  null,
    "fileVaultDisablePromptAtSignOut":  false,
    "fileVaultPersonalRecoveryKeyRotationInMonths":  null,
    "firewallApplications":  [

                             ]
}
